# LDevice_Reset

## Description
Reset the specified lighting device object.

```pascal
PROCEDURE LDevice_Reset(h : HANDLE);
```

```python
def vs.LDevice_Reset(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|   |

## Version
Availability: from Vectorworks 2015

## Category
* Spotlight